Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.GetUnitsDecimalSettings(Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals@)
Gets modeling unit settings.
unitsDecimals: Units and decimals for object.
Returns:
true if select switch is on; otherwise, false.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.GetUnitsDecimalSettings(Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals@)
Gets unit settings.
unitsDecimals: Units and decimals for object.
Returns:
true if select switch is on; otherwise, false.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.GetOptionInt(System.String)
Gets the integer advanced option value.
optionName: Name of the option.
Returns: The integer advanced option value.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.GetModelingUnitsDecimalSettings(Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.ModelingUnitsDecimals@)
Gets Modeling unit settings.
unitsDecimals: Units and decimals for object.
Returns:
true if select switch is on; otherwise, false.

Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.GetMepUnitsDecimalSettings(Tekla.Structures.TeklaStructuresInternal.TeklaStructuresSettingsHelper.MepUnitsDecimals@)
Gets Mep unit settings.
unitsDecimals: Units and decimals for object.
Returns:
true if select switch is on; otherwise, false.